app/controllers/login_controller.rb

  def sign_up
    @user = User.create_user(user_param)
    if @user.save
---
INSERT INTO `users` (`first_name`, `last_name`, `mobile`, `email`, `password`, `role_id`, `created_at`, `updated_at`) VALUES ('Amit', 'Pandey', '98766555', 'amit_iitm@yahoo.com', '8cb2237d0679ca88db6464eac60da96345513964', 1, '2017-02-23 18:39:18', '2017-02-23 18:39:18')
UPDATE `users` SET `password` = '12345', `updated_at` = '2017-02-23 18:21:05' WHERE `users`.`id` = 1

  def sign_in
    if request.method.eql? 'POST'
      user_info = User.authenticate(params[:email], params[:password])
      if user_info.present?
---
SELECT  "users".* FROM "users" WHERE ((email = 'amit.pandey.iitm@gmail.com'  OR mobile = 'amit.pandey.iitm@gmail.com' )AND password = '7c4a8d09ca3762af61e59520943dc26494f8941b') ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]